docs/math530/KBrefLinearFunctional.tex
% Created 2021-09-11 Sat 08:18
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Linear Functional}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Linear Functional},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler6.39 linear functional\hfill{}\textsc{def}}
\label{sec:orgbeb48d6}
\begin{quote}
A \emph{linear functional} on \(V\) is a linear map from \(V\) to \(\mathbb F\). In other words, a linear functional is an element of \(\mathcal L(V, \mathbb F)\)
\end{quote}
\section{results}
\label{sec:org717fdd5}
\subsection{Axler6.42 Riesz Representation Theorem}
\label{sec:org7687a0f}
Any map defined by \(u \in  V\) that sends each \(v \in  V\) to \(\langle  u, v \rangle\) is a linear functional. This result says that every linear functional is such a map.
\begin{quote}
Suppose \(V\) is finite-dimensional and \(\varphi\) is a linear functional on \(V\). Then there is a unique vector \(u \in  V\) s.t.
\[\begin{aligned}
   \varphi (v) = \langle v, u \rangle
   \end{aligned}\]
For every \(v \in V\).
\end{quote}
Any map from an \$n\$-dimensional space to a 1-dimensional space is just a \(1 \times n\) matrix, which is really just a linear combination.
\end{document}
